+++
categories = ["OS Loader", "ELAM", "OslLoadDrivers"]
tags = ["OS Loader", "OslLoadDrivers", "ELAM"]
date = "2019-03-24"
description = "Pequeña explicacion sobre como el Loader del SO se encarga de cargar los drivers esenciales, centrandonos en el ELAM Driver"
images = ["https://n4r1b.netlify.com/images/oslLoadDrivers/oslLoadDrivers.jpg"]
featured = ["https://n4r1b.netlify.com/images/oslLoadDrivers/oslLoadDrivers.jpg"]
featuredalt = ""
featuredpath = "date"
linktitle = ""
title = "Como carga los Drivers esenciales el BootLoader"
slug = "Como carga los Drivers esenciales el BootLoader"
type = "posts"
+++

Hola otra vez! Esta vez vamos a ver algo anterior al Kernel (Si! hay vida antes del Kernel 😅), mas especificamente vamos a ver como durante el proceso de carga del SO se cargan en memoria los drivers que Windows necesita para poder comenzar su ejecucion. Y para el estudio voy a centrarme en un Driver en especifico, el Early Launch Anti-Malware Driver, mas conocido como ELAM. La motivacion principal es que mas adelante quiero hacer una entrada explicando y hablando a fondo de como este Driver ayuda a proteger al sistema de posibles Rootkits.

## Bootloader
Una vez el Boot Manager termina de cargar el Loader del SO le pasa el control y este se encargara de cargar gran parte de los componentes del Kernel de Windows, finalmente la ejecucion pasara al Kernel y a partir de este punto es cuando comienza a ejecutar Windows como tal. 


Finalmente se van a colocar el *Flink* y el *Blink* de la ```LIST_ENTRY``` de forma que apunten a la entrada anterior y al principio de la la lista y se va a proceder a cargar los imports del Driver que se ha cargado. De esto se va a encargar la funcion ```LdrpLoadImports``` que no voy a detallar porque funciona igual en Userland, para que os hagais una idea obtiene el ```IMAGE_DATA_DIRECTORY``` de la tabla de imports y con esto obtiene el ```IMAGE_IMPORT_DESCRIPTOR``` y a continuacion itera llamando a ```LdrpLoadImage``` para cargar la imagen y a ```BlLdrBindImportReferences``` para enlazar los imports al binario y eso seria todo, ahora se empezaria a salir de las funciones hasta volver a la funcion ```OslLoadDrivers``` que es la encargada  de asignar el campo *DriverLoadNtStatus* y se devuelve el *NTSTATUS* correspondiente a la funcion que ha intentado cargar el Driver (En este caso ```OslpLoadAllModules```) 

Aqui podeis ver como quedaria la estructura _BOOT_DRIVER_LIST_ENTRY una vez se ha cargar el ELAM Driver de Windows:

![alt img](/images/oslLoadDrivers/boot_driver_entry.jpg "Boot Driver entry")

Siento mis dotes con el Paint, si haceis zoom se ven mejor los colores!! El DriverTag es 0xFFFFFFFF porque el Driver WdBoot no tiene clave DriverTag en el registro.

## Conclusiones

Esto ha sido todo por hoy, debajo dejare unas Notas que quiza os interese leer si quereis entender mejor ciertas cosas. Como ya he comentado me gustaria hablar del ELAM de Windows en una proxima entrada y espero que esto os haya levantado algo de curiosidad por este Driver y en general por el Bootloader de Windows.

Como siempre, espero que os haya gustado y que no se os haya hecho muy pesado!! Si teneis cualquier duda no dudeis en poneros en conctacto conmigo! (Es gratis 🤣🤣) y se que he dejado muchisimas cosas de lado y quiza cosas sin explicar que he dado por echo, pero creedme que el Bootloader tiene muchisimo codigo y para que engañarnos cosas bastante complejas 🤣 por eso he intentado centrarme en ciertos puntos que me parecian interesantes. Y si he metido la pata en algo, por favor, decidmelo sin problema! (Podeis hasta meteros conmigo si os hace ilusion y tambien es gratis!!)

## Notas
Aqui voy a comentar un par de temas que he dejado sin explicar arriba porque no eran del todo relevantes para el articulo en si, pero creo que si que son interesantes y no esta de mas comentarlos un poco.

<a name="loader_param_block_notes">
#### LOADER_PARAMETER_BLOCK
</a>
El [```LOADER_PARAMETER_BLOCK```](https://www.geoffchappell.com/studies/windows/km/ntoskrnl/structs/loader_parameter_block.htm) es posiblemente la estructura mas importante en el Bootloader. En esta estructura se ira recopilando informacion durante el proceso de carga del SO y posteriormente toda esta informacion sera pasada al Kernel y al HAL (Se guarda una referencia en la variable ```KeLoaderBlock```). Por suerte, Microsoft ha cambiado de parecer con esta estructura y parece ser que desde la version **Windows 10 1803 Redstone 4 (Spring Creators Update)** han decidido hacer publica esta estructura en un fichero de cabecera (Antes estaba en los simbolos, pero no en un Header file)
```
kd> dt nt!_LOADER_PARAMETER_BLOCK
   +0x000 OsMajorVersion   : Uint4B
   +0x004 OsMinorVersion   : Uint4B
   +0x008 Size             : Uint4B
   +0x00c OsLoaderSecurityVersion : Uint4B
   +0x010 LoadOrderListHead : _LIST_ENTRY
   +0x020 MemoryDescriptorListHead : _LIST_ENTRY
   +0x030 BootDriverListHead : _LIST_ENTRY
   +0x040 EarlyLaunchListHead : _LIST_ENTRY
   +0x050 CoreDriverListHead : _LIST_ENTRY
   +0x060 CoreExtensionsDriverListHead : _LIST_ENTRY
   +0x070 TpmCoreDriverListHead : _LIST_ENTRY
   +0x080 KernelStack      : Uint8B
   +0x088 Prcb             : Uint8B
   +0x090 Process          : Uint8B
   +0x098 Thread           : Uint8B
   +0x0a0 KernelStackSize  : Uint4B
   +0x0a4 RegistryLength   : Uint4B
   +0x0a8 RegistryBase     : Ptr64 Void
   +0x0b0 ConfigurationRoot : Ptr64 _CONFIGURATION_COMPONENT_DATA
   +0x0b8 ArcBootDeviceName : Ptr64 Char
   +0x0c0 ArcHalDeviceName : Ptr64 Char
   +0x0c8 NtBootPathName   : Ptr64 Char
   +0x0d0 NtHalPathName    : Ptr64 Char
   +0x0d8 LoadOptions      : Ptr64 Char
   +0x0e0 NlsData          : Ptr64 _NLS_DATA_BLOCK
   +0x0e8 ArcDiskInformation : Ptr64 _ARC_DISK_INFORMATION
   +0x0f0 Extension        : Ptr64 _LOADER_PARAMETER_EXTENSION
   +0x0f8 u                : <unnamed-tag>
   +0x108 FirmwareInformation : _FIRMWARE_INFORMATION_LOADER_BLOCK
   +0x148 OsBootstatPathName : Ptr64 Char
   +0x150 ArcOSDataDeviceName : Ptr64 Char
   +0x158 ArcWindowsSysPartName : Ptr64 Char
```
Esto aplica para la siguiente version de Windows:
**Windows 10 Kernel Version 17763.1.amd64fre.rs5_release.180914-1434** y en este [enlace](https://www.vergiliusproject.com/kernels/x64/Windows%2010%20%7C%202016/1809%20Redstone%205%20(October%20Update)/_LOADER_PARAMETER_BLOCK) lo teneis en formato struct de C

Si venis de el enlace que he puesto arriba [pulsad aqui](#go_back) y subis de nuevo! (Si no venis de ahi, omitid esto 🤣🤣)

<a name="system_hive_notes">
#### SystemHive
</a>
La funcion encargada de cargar el [Hive](https://docs.microsoft.com/en-us/windows/desktop/sysinfo/registry-hives) del Sistema (```OslpLoadSystemHive```) esta funcion recibe tres parametros:

-   Un **DeviceID** este valor simplemente es un indice en la tabla ```DmDeviceTable``` que es la tabla que contiene los los *dispositivos* abiertos ([Notas DeviceId](#device_notes))
